Revit 2027 API
StairsRunType.IsSlanted Property
 True if risers will be slanted, false if they will be straight.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSlanted { get; set; }
Public Property IsSlanted As Boolean
	Get
	Set
public:
property bool IsSlanted {
	bool get ();
	void set (bool value);
}
member IsSlanted : bool with get, set
Property Value
Boolean
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace